// https://stormtower.ru/generator/sluchaynyie-vstrechi-v-selskoy-mestnosti.html
/*
Даже самая скучная прогулка по деревенским окрестностям может принести весьма интересные встречи, особенно, если иметь
под рукой этот сборник таблиц для настольных ролевых игр. Всё что вас требуется, сделать три несложных шага:

Выберите уровень опасности будущей встречи и определите по таблице 1 какого типа столкновение грозит игрокам.
По соответствующим таблицам найдите нужные результаты или следуйте указаниям.
Таблица «награда» нужна не всегда – не все проходные встречи с дровосеками и солдатами сулят какую-то прибыль, да и с
зазевавшегося медведя стрясти десяток золотых монет, также бывает весьма не просто.

Таблица 1: тип встречи

Уровень опасности 1 Уровень опасности 2 Уровень опасности 3 Результат
1-30	            1-35                1-25                [ЛЮДИ] [ДЕЙСТВИЯ] [НАГРАДА]
31-35	            36-45               26-40               [ЗАСАДА] [ХИТРОСТЬ] [СТРАТЕГИЯ] [НАГРАДА]
36-45	            46-60               41-60               [ЖИВОТНОЕ] [РАЗМЕР] [НАГРАДА]
46-55	            61-75               61-80               [ОПАСНОСТЬ]
56-65	            76-90               81-99               [ЛЮДИ] [ОПАСНОСТЬ]
66-100	            91-100              100                 [ПРЕДОСТЕРЕЖЕНИЕ]

Столкновения с людьми

1d100	Результат
1-2	    уточните по таблице [Работяги]
3-4	    уточните по таблице [Специалисты]
5-6	    1d4 бандитов
7-8	    1d4 угонщиков скота
9-10	1d4 стражников
11-12	1d4 фермеров
13-14	1d4 рыбаков
15-16	1d4 нищих проходимцев
17-18	1d4 пастухов
19-20	1d4 конокрадов
21-22	1d4 рабочих
23-24	1d4 моряков
25-26	1d4 наемников
27-28	1d4 изгоев
29-30	1d4 пиратов
31-32	1d4 старателей
33-34	1d4 беженцев
35-36	1d4 пилигримов
37-38	1d4 слуг аристократа
39-40	1d4 головорезов
41-42	1d4 путешественников
43-44	1d4 состоятельных граждан с 1d4 охранниками
45-46	1d4+1 искателей приключений
47-48	1d6 цыган
49-50	1d4 заключенных конвоируемых 1d4 стражниками
51-52	Молодая пара
53-54	Подмастерье
55-56	Артист
57-58	Охотник за головами
59-60	Мастер
61-62	Иностранный купец с 1d4 стражниками
63-64	Беглец
65-66	Целитель или травник
67-68	Торговец лошадьми
69-70	Охотник
71-72	Дуэлянт
73-74	Профессиональный вор
75-76	Купец с 1d4+1 стражниками
77-78	Гонец
79-80	Военный патруль из 1d4+2 солдат
81-82	Силач
83-84	Аристократ с 1d4 друзьями
85-86	Изгнанник
87-88	Отдыхающий путник
89-90	Человек из свиты короля с 1d10+3 конными воинами
91-92	Лучник-мастер
93-94	Шпион
95-96	Вор
97-98	Сапожник
99-100	Сборщик налогов

Их действия в данный момент

1d100	Результат
1-2	    Спор
3-4	    Купание
5-6	    Спасается от преследования
7-8	    Связанный с кляпом во рту
9-10	Клеймит животное
11-12	Что-то зарывает, возможно хоронит
13-14	Гонится за кем-то
15-16	Плачет
17-18	Что-то яростно уничтожает
19-20	Роет
21-22	Рисует на земле
23-24	Скучает
25-26	Пьяный
27-28	Готовится к поединку
29-30	Ест
31-32	Устал
33-34	Возбужден
35-36	Сражается
37-38	Ловит рыбу
39-40	Что-то прячет
41-42	Охотится
43-44	Ранен
45-46	Убивает
47-48	Потерялся
49-50	Размышляет
51-52	Разбирает завал на пути
53-54	Нуждается в помощи
55-56	Ведет какие-то переговоры
57-58	Что-то ищет
59-60	Строит планы
61-62	Играет в игру
63-64	Играет на музыкальном инструменте
65-66	Молится
67-68	Что-то покупает
69-70	Спасается от бандитов
71-72	Кого-то расспрашивает
73-74	Кажется сидит в засаде
75-76	Кажется пережил ограбление
77-78	Ремонтирует повозку
79-80	Отдыхает
81-82	Кого-то ищет
83-84	Болен
85-86	Поет
87-88	Курит трубку
89-90	Выкуривает животное из норы
91-92	Свежует тушу
93-94	Что-то внимательно изучает
95-96	Следит
97-98	Тренируется
99-100	Угодил в ловушку

Работяги (уточняющая таблица)

1d100	Результат
1	    Акробат
2	    Актер
3	    Дрессировщик
4	    Оружейник
5	    Артист
6	    Пекарь
7	    Парикмахер
8	    Корзинщик
9	    Пчеловод
10	    Процентщик
11	    Кузнец
12	    Лучник
13	    Пивовар
14	    Мясник
15	    Столяр
16	    Каретник
17	    Сыровар
18	    Трубочист
19	    Музыкант
20	    Повар
21	    Бондарь
22	Курьер
23	Глашатай
24	Танцовщик
25	Рабочий доков
26	Кучер
27	Вышивальщик
28	Гравер
29	Жонглер
30	Палач
31	Сокольничий
32	Фермер
33	Батрак
34	Фехтовальщик
35	Рыбак
36	Мастер по изготовлению стрел
37	Лесник
38	Гадалка
39	Стеклодув
40	Ювелир
41	Могильщик
42	Гвардеец
43	Гид
44	Целитель
45	Рулевой
46	Травник
47	Пастух
48	    Конюх
49	    Собаковод
50  	Охотник
51	Тюремный смотритель
52	Ювелир
53	Чернорабочий
54	Прачка
55	Кожевник
56	Библиотекарь
57	Слесарь
58	Служанка
59	Каменщик
60	Наемник
61	Гонец
62	Акушерка
63	Мельник
64	Шахтер
65	Музыкант
66	Няня
67	Маляр
68	Парфюмер
69	Портье
70	Гончар
71	Проповедник
72	Проститутка
73	Врач-шарлатан
74	Веревочник
75	Писец
76	Служитель
77	    Погонщик
78	    Кораблестроитель
79	    Сапожник
80	    Серебряных дел мастер
81	Контрабандист
82	Мыловар
83	Оруженосец
84	Конюх
85	Каменщик
86	Портной
87	Дубильщик
88	Татуировик
89	Тавернщик
90	Сборщик налогов
91	Таксидермист
92	Учитель
93	Бакалейщик
94	Сборщик пошлин
95	Специалист по пыткам
96	Специалист по выведению крыс
97	Охотник на медведей
98	Ткач
99	Колесных дел мастер
100	Лесоруб

Специалисты (уточняющая таблица)

1d20	Результат
1	    Бухгалтер
2	    Аптекарь
3	    Судья
4	    Архитектор
5	    Картограф
6	    Чиновник городского самоуправления
7   	Куртизанка
8	    Дипломат
9	    Врач
10	    Инженер
11	Адвокат
12	Коммерсант
13	Военный офицер
14	Языковед
15	Ученый
16	Кабатчик
17	Виноторговец
18	Церковнослужитель
19	Дуэлянт
20	Ростовщик

Засада

1d100	Результат
1-30	Бандиты
31-40	Военный патруль
41-50	Преступники
51-60	Головорезы
61-70	Городская стража
71-75	Цыгане
76-80	Пираты
81-85	Снайпер
86-90	Охотник за головами
91-95	Убийца
96-100	Мастер убийца

Хитрость

1d100	Результат
1-25	Нет
26-50	Путь заблокирован
51-65	Стратегическая точка
66-75	Нельзя пользоваться транспортом
76-80	Маскировка
81-85	Засланный казачок
86-90	Ранение/болезнь
91-95	Заманить в глушь
96-99	Стихийное бедствие
100	    Яма-ловушка

Стратегия

1d100	Результат
1-25	Яростная атака
26-45	Дистанционный бой
46-65	Атака из укрытия
66-80	Ловушки
81-85	Падающая сверху сеть
86-90	Падающие сверху камни и т.п.
91-95	Гранаты и взрывы
96-100	Яд

Животные

1d20	Результат
1	Аллигатор
2	Росомаха
3	Большой паук
4-6	Медведь
7	Рысь
8	Удав
9	Гигантские крысы
10	Скорпион
11	Ядовитая змея
12-14	Дикий кабан
15	Дикий пес
16-18	Волк
19	Большой слизень
20	Большая летучая мышь

Размер

Сделайте бросок 1d20. Если значение – меньше, чем результаты из следующей таблицы, размер животного считается нормальным. Если больше – размер увеличивается на 1 (т.е. большое становится гигантским и т.д.).

Уровень опасности	Результат
1	18+
2	14+
3	10+

Опасность

1d100	Результат
1-20	Ловушка
21-35	Плохая вода
36-50	Расселина в леднике
51-65	Страшная буря
66-75	Тепловой удар
76-80	Землетрясение
81-85	Лесной пожар
86-90	Ядовитые испарения
91-95	Плывун
96-100	Камнепад

Предостережение

1d20	Результат
1	На ветви дерева висит чье-то тело
2	Столб с пустой клеткой, по размеру достаточной для человека
3	Несколько стрел торчат из тела мертвого животного
4	Дорогу пересекают кровавые следы
5	Медленно разгорающийся лесной пожар
6	Останки солдата пригвождены к дереву копьем
7	Испорченный круг из камней
8	Угли от недавнего большой костер
9	Сильный запах полевых цветов
10	Сильный запах пищи
11	Бесхозная вязанка дров
12	Странные крупные следы на дороге
13	Стервятники кружат над головой
14	Стрела торчит из дерева
15	Непонятная / странная надпись на большом камне
16	Внезапное падение температуры
17	Путь заблокирован
18	Похоже что недавно тут собирали баррикаду
19	Разграбленный караван
20	Легко преодолимые с виду препятствия на пути

Награда

1d100	Результат
1-25	Еда
26-40	Обычная добыча
41-55	Улика / указатель
56-70	Кошелек
71-85	Мертвое тело
86-92	Природное ископаемое
93-97	Яд
98	Вход в подземелье
99	Именно то, что нужно!
100	Необычная добыча

Пример использования

Ладно, я допускаю, что в этой местности возможны 3 проходные встречи в пути. Выясняю что это будут за встречи (уровень опасности 3):

Выпадает 8, 24, 48 по таблице 1. Имеем, таким образом:

Встречу с людьми
Встречу с животными
Встречу с людьми
Сначала животные: по таблице «Животные» выпадает 2, то есть встреча с росомахой. По таблице «Размер» выпадает 11, а так как уровень опасности у меня 3, то моя росомаха будет не простой, а гигантской. Гхм. Должно быть, когда свирепая тварь вспрыгнет им на головы, искатели приключений будут впечатлены. Что касается награды: выпало 69, т.е. «кошелек». Учитывая, что у росомахи, даже самой большой, кошелька при себе может не оказаться, просто игнорирую таблицу «награда» и иду дальше. Хотя, как вариант, ничего не игнорирую, а просто отмечаю для себя – в случае успешной битвы, глава ближайшей общины решит вознаградить героев за подвиг… ну да, кошельком с монетами. Вот так просто.

Теперь люди: выпадет 48. Стало быть (таблица «Люди») имеем 3 заключенных конвоируемых 3 стражниками. По таблице «действие в данный момент» узнаем (36), что в данный момент… идет сражение. Отлично, все просто – узники взбунтовались и сражаются против конвоиров. Может быть им даже помогают сообщники? Награда: (46) улика. Эй, по-моему отлично. Эти трое злодеев, к примеру, объявлены дерзкой бандой Фиолетового Джека, прославившегося тем, что недавно напал на свиту царского сына во время охоты. Считается, что эти трое – и есть вся банда с атаманом, но кто тогда помогал им в сражении? Скорее всего это их сообщники во главе с избежавшим правосудия главарем!

Ещё одна встреча: (91) Лучник-мастер, который… (98) тренируется! Ну и правильно делает, мастерство нужно держать в форме. Это очень хорошо, что он мне попался – в крайнем случае, именно он и спасет героев от гигантской росомахи. Ну, или попросит помочь ему выследить чудовищную тварь (все-таки он мастер-лучник, а не мастер-охотник). Награда: вообще, так как я уже приплел лучника к истории про росомаху, какой-то персональной награды или выгоды (кроме того что я сказал выше) от общения с ним не предусмотрено. Зато он может подсказать к кому идти за деньгами после успешного выполнения дела.

 */
